BACKEND/app/Controllers/Auth.php

SELECT *
FROM `usuarios`
WHERE `email` = 'goselu@nexus.com'
 LIMIT 1
---
    public function login()
    {
        $json = $this->request->getJSON();

        // 1. Validar que llegan los datos
        if (!$json || !isset($json->email) || !isset($json->password)) {
            return $this->respond(['status' => 'error', 'message' => 'Faltan datos'], 400);
        }

        // 2. Buscar al usuario por Email
        $usuarioModel = new UsuarioModel();
        $user = $usuarioModel->where('email', $json->email)->first();

INSERT INTO `usuarios` (`nombre`, `email`, `password`, `rol_id`, `empresa_id`) VALUES ('Jesus Clemente', 'jesusclemente@nexus.com', '$2y$10$kvfHiYus4Nn4zwifw3UNhOm54NDG.z7/38CwSHoX.at093PNfU9f.', 3, '5')
---
            'empresa_id' => null
        ];

        $usuarioModel->insert($nuevoUsuario);