BACKEND/app/Controllers/Categorias.php

    public function index($empresaId = null) {
        $db = \Config\Database::connect();
        $cats = $db->table('categorias')
                   ->where('empresa_id', $empresaId)
                   ->get()->getResult();
---
SELECT *
FROM `categorias`
WHERE `empresa_id` = '5'