BACKEND/app/Controllers/Clientes.php

    public function getByEmpresa($empresaId = null) {
        $model = new ClienteModel();
        return $this->respond($model->where('empresa_id', $empresaId)->findAll());
---
SELECT *
FROM `clientes`
WHERE `empresa_id` = '5'