BACKEND/app/Controllers/Dashboard.php

    public function index() {

        $usuario_id = $this->request->getGet('usuario_id');

        if (!$usuario_id) {
            return $this->respond(['status' => 'error', 'message' => 'Falta ID usuario'], 400);
        }

        $usuarioModel = new UsuarioModel();
        $empresaModel = new EmpresaModel();

        $usuario = $usuarioModel->find($usuario_id);

        if (!$usuario || !$usuario['empresa_id']) {
             return $this->respond(['status' => 'error', 'message' => 'Usuario sin empresa'], 404);
        }

        $empresa = $empresaModel->find($usuario['empresa_id']);
---
SELECT *
FROM `empresas`
WHERE `empresas`.`id` = '3'