BACKEND/app/Controllers/Dashboard.php

SELECT *
FROM `usuarios`
WHERE `id` = '10'
SELECT `id`, `nombre`, `email`, `rol_id`
FROM `usuarios`
WHERE `empresa_id` = '5'
AND `id` != '10'
---
    public function index($usuarioId = null) {
        try {
            $db = \Config\Database::connect();

            $usuario = $db->table('usuarios')->where('id', $usuarioId)->get()->getRowArray();

            if (!$usuario) {
                return $this->failNotFound('Usuario no encontrado');
            }

            $empresaId = $usuario['empresa_id'];

            $equipo = $db->table('usuarios')
                         ->select('id, nombre, email, rol_id')
                         ->where('empresa_id', $empresaId)
                         ->where('id !=', $usuarioId)
                         ->get()->getResultArray();

SELECT SUM(`total`) AS `total`, COUNT(`id`) AS `cantidad_ventas`
FROM `ventas`
WHERE `usuario_id` = '10'
AND  `fecha_venta` LIKE '2026-02%' ESCAPE '!'
---
            if ($db->tableExists('ventas')) {
                $mesActual = date('Y-m');

                $resultadoMes = $db->table('ventas')
                                   ->selectSum('total')
                                   ->selectCount('id', 'cantidad_ventas')
                                   ->where('usuario_id', $usuarioId)
                                   ->like('fecha_venta', $mesActual, 'after')
                                   ->get()->getRowArray();

SELECT `ventas`.`id`, `ventas`.`fecha_venta` as `created_at`, `ventas`.`total`, `clientes`.`nombre` as `cliente_nombre`, `ventas`.`estado`
FROM `ventas`
LEFT JOIN `clientes` ON `clientes`.`id` = `ventas`.`cliente_id`
WHERE `ventas`.`usuario_id` = '10'
ORDER BY `ventas`.`fecha_venta` DESC
 LIMIT 3
---

                // ULTIMAS VENTAS
                if ($db->tableExists('clientes')) {
                    $ventasRecientes = $db->table('ventas')
                                          ->select('ventas.id, ventas.fecha_venta as created_at, ventas.total, clientes.nombre as cliente_nombre, ventas.estado')
                                          ->join('clientes', 'clientes.id = ventas.cliente_id', 'left')
                                          ->where('ventas.usuario_id', $usuarioId)
                                          ->orderBy('ventas.fecha_venta', 'DESC') // <--- CAMBIO AQUÍ
                                          ->limit(3)
                                          ->get()->getResultArray();