BACKEND/app/Controllers/Personal.php

SELECT `id`, `nombre`, `email`, `dias_disponibles`, `created_at`
FROM `usuarios`
WHERE `id` = '11'
---
    public function getDashboard($userId = null) {
        $db = \Config\Database::connect();

        // 1. Usuario
        $usuario = $db->table('usuarios')
                      ->select('id, nombre, email, dias_disponibles')
                      ->where('id', $userId)
                      ->get()->getRowArray();