BACKEND/app/Controllers/Personal.php

    public function getDashboard($userId = null) {
        $db = \Config\Database::connect();

        // 1. USUARIO (AHORA CON NOMBRE DE EMPRESA)
        // Usamos 'usuarios.id' para evitar el error "Column 'id' is ambiguous"
        $usuario = $db->table('usuarios')
                      ->select('usuarios.id, usuarios.nombre, usuarios.email, usuarios.dias_disponibles, usuarios.empresa_id, empresas.nombre as empresa_nombre')
                      ->join('empresas', 'empresas.id = usuarios.empresa_id', 'left')
                      ->where('usuarios.id', $userId)
                      ->get()->getRowArray();

        if (!$usuario) return $this->failNotFound('Usuario no encontrado');

        // 2. FICHAJES
        $fichajes = $db->table('fichajes')
                       ->where('usuario_id', $userId)
                       ->orderBy('entrada', 'DESC')
                       ->get()->getResultArray();

        // 3. ESTADO ACTUAL
        $fichajeActivo = $db->table('fichajes')
                            ->where('usuario_id', $userId)
                            ->where('salida', null)
                            ->orderBy('entrada', 'DESC')
                            ->get()->getRowArray();

        // 4. NÓMINAS (Con arreglo de URL)
        $nominas = $db->table('nominas')
                      ->where('usuario_id', $userId)
                      ->orderBy('created_at', 'DESC')
                      ->get()->getResultArray();
---
SELECT `usuarios`.`id`, `usuarios`.`nombre`, `usuarios`.`email`, `usuarios`.`dias_disponibles`, `usuarios`.`empresa_id`, `empresas`.`nombre` as `empresa_nombre`
FROM `usuarios`
LEFT JOIN `empresas` ON `empresas`.`id` = `usuarios`.`empresa_id`
WHERE `usuarios`.`id` = '11'
SELECT *
FROM `fichajes`
WHERE `usuario_id` = '11'
ORDER BY `entrada` DESC
SELECT *
FROM `fichajes`
WHERE `usuario_id` = '11'
AND `salida` IS NULL
ORDER BY `entrada` DESC
SELECT *
FROM `nominas`
WHERE `usuario_id` = '11'
ORDER BY `created_at` DESC

            $n['url_descarga'] = $rutaBase . $n['archivo'];
        }

        $solicitudes = $db->table('solicitudes_ausencia')
                          ->where('usuario_id', $userId)
                          ->orderBy('created_at', 'DESC')
                          ->get()->getResultArray();
---
SELECT *
FROM `solicitudes_ausencia`
WHERE `usuario_id` = '11'
ORDER BY `created_at` DESC

    public function fichar() {
        $data = $this->request->getJSON(true);
        $usuarioId = $data['usuario_id'];
        $empresaId = $data['empresa_id']; // Nos aseguramos de recibir esto

        $db = \Config\Database::connect();
        $builder = $db->table('fichajes');

        // Buscar si ya hay un turno abierto
        $abierto = $builder->where('usuario_id', $usuarioId)
                           ->where('salida', null)
                           ->get()->getRowArray();

        if ($abierto) {
            // CERRAR TURNO (SALIDA)
            $builder->where('id', $abierto['id'])->update(['salida' => date('Y-m-d H:i:s')]);
            return $this->respond(['status' => 'success', 'tipo' => 'salida']);
        } else {
            // ABRIR TURNO (ENTRADA)
            $builder->insert([
                'usuario_id' => $usuarioId,
                'empresa_id' => $empresaId,
                'entrada' => date('Y-m-d H:i:s')
            ]);
---
SELECT *
FROM `fichajes`
WHERE `usuario_id` = '11'
AND `salida` IS NULL
UPDATE `fichajes` SET `salida` = '2026-02-15 18:50:21'
WHERE `id` = '10'
INSERT INTO `fichajes` (`usuario_id`, `empresa_id`, `entrada`) VALUES ('11', '5', '2026-02-15 18:54:03')