BACKEND/app/Controllers/Personal.php

    public function getDashboard($usuarioId = null) {
        $db = \Config\Database::connect();

        // 1. Obtener Usuario + Nombre Empresa
        $usuario = $db->table('usuarios')
                      ->select('usuarios.*, empresas.nombre as nombre_empresa')
                      ->join('empresas', 'empresas.id = usuarios.empresa_id', 'left')
                      ->where('usuarios.id', $usuarioId)
                      ->get()->getRow();

        // 2. Turno Activo
        $fichajeModel = $db->table('fichajes');
        $turnoActual = $fichajeModel->where('usuario_id', $usuarioId)
                                    ->where('salida', NULL)
                                    ->get()->getRow();

        // 3. Historial (AMPLIADO a 100 para permitir navegación entre semanas)
        $historial = $fichajeModel->where('usuario_id', $usuarioId)
                                  ->orderBy('entrada', 'DESC')
                                  ->limit(100) // Traemos suficientes para navegar
                                  ->get()->getResult();

        // 4. Ausencias y Nómina
        $ausencias = $db->table('ausencias')->where('usuario_id', $usuarioId)->get()->getRow();
        $nomina = $db->table('nominas')->where('usuario_id', $usuarioId)->orderBy('id', 'DESC')->get()->getRow();
---
SELECT *
FROM `fichajes`
WHERE `usuario_id` = '9'
AND `salida` IS NULL
SELECT *
FROM `fichajes`
WHERE `usuario_id` = '9'
ORDER BY `entrada` DESC
 LIMIT 100
SELECT *
FROM `fichajes`
WHERE `usuario_id` = '11'
ORDER BY `entrada` DESC
 LIMIT 10
SELECT *
FROM `ausencias`
WHERE `usuario_id` = '9'
SELECT *
FROM `fichajes`
WHERE `usuario_id` = '11'
AND `salida` IS NULL
ORDER BY `entrada` DESC
SELECT *
FROM `nominas`
WHERE `usuario_id` = '9'
ORDER BY `id` DESC