BACKEND/app/Controllers/Productos.php

    public function index($empresaId = null) {
        $db = \Config\Database::connect();

        $productos = $db->table('productos')
                        ->where('empresa_id', $empresaId)
                        ->orderBy('created_at', 'DESC')
                        ->get()->getResult();
---
SELECT *
FROM `productos`
WHERE `empresa_id` = '7'
ORDER BY `created_at` DESC