BACKEND/app/Controllers/Productos.php

    public function index($empresaId = null) {
        $db = \Config\Database::connect();

        // Hacemos un SELECT * FROM productos WHERE empresa_id = X
        $productos = $db->table('productos')
                        ->where('empresa_id', $empresaId)
                        ->orderBy('created_at', 'DESC') // Para que los nuevos salgan primero
                        ->get()->getResult();
---
SELECT *
FROM `productos`
WHERE `empresa_id` = '5'
ORDER BY `created_at` DESC

    public function show($id = null) {
        $db = \Config\Database::connect();
        $producto = $db->table('productos')->where('id', $id)->get()->getRowArray();
---
SELECT *
FROM `productos`
WHERE `id` = '1'