BACKEND/app/Controllers/RRHH.php

    public function subirNomina() {
        $adminId = $this->request->getPost('admin_id');
        if (!$this->verificarPermisosRRHH($adminId)) {
            return $this->failForbidden('Acceso denegado.');
        }

        try {
            $file = $this->request->getFile('nomina');
            $usuarioId = $this->request->getPost('usuario_id');
            $mes = $this->request->getPost('mes');

            if (!$file || !$file->isValid()) return $this->fail('Archivo no válido');

            $uploadPath = FCPATH . 'uploads/nominas';
            if (!is_dir($uploadPath)) mkdir($uploadPath, 0777, true);

            $newName = $file->getRandomName();
            $file->move($uploadPath, $newName);

            $nominaModel = new NominaModel();
            $nominaModel->insert([
                'usuario_id' => $usuarioId,
                'mes' => $mes,
                'archivo' => 'uploads/nominas/' . $newName
            ]);
---
INSERT INTO `nominas` (`usuario_id`, `mes`, `archivo`, `created_at`) VALUES ('11', '2026-03', 'uploads/nominas/1771187594_f149a165285ba21b21c7.pdf', '2026-02-15 20:33:14')